#Створити клас «Товар», який містить назву, дату виготовлення, ціну, кількість одиниць, 
#а також методи порівняння дат та обчислення сумарної вартості товару. На його основі 
#створити класи-нащадки «Промисловий товар», що додатково зберігає умови транспортування, 
#місце знаходження товару(на складі, в торговому залі) та «Харчовий продукт», який додатково 
#містить термін зберігання продукту. Створити n номенклатур промислових товарів та m номенклатур 
#харчових продуктів. Визначити загальну вартість харчових продуктів, термін зберігання яких 
#закінчився, і загальну вартість промислових товарів, які знаходяться на складі.
import Funcs
n=int(input("Enter the amount of prom.products:"))
proms=[]
Funcs.create_proms(n, proms)
m=int(input("Enter the amount of eatable products:"))
eats=[]
Funcs.create_eats(m, eats)
bads=Funcs.bad_products(m, eats) 
stock=Funcs.stock_products(n, proms) 
Funcs.show(bads, stock)